/***************************************************************************************************
 * Зона, необходимая для Angular.
 */
import 'zone.js';  // Included with Angular CLI.

/***************************************************************************************************
 * Импорты для поддержки старых браузеров. Убедитесь, что они раскомментированы, если нужно.
 */
// import 'classlist.js';  // Добавляет поддержку classList для IE9 и IE10.
// import 'core-js/es/array'; // Добавляет поддержку методов массивов, например includes.
// import 'intl'; // Если нужна поддержка международных API (для IE).

/***************************************************************************************************
 * Настройка локализации.
 */
// import 'intl/locale-data/jsonp/en'; // Поддержка определённого языка.
